Update architecture diagram
